package ru.shop.backend.search.service;

public class SearchConstants {
    public static final char[] ruLayout =
            {'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х',
            'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э',
            'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.',
            ' ', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '-'};
    public static final char[] enLayout =
            {'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']',
            'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', '"', 'z', 'x',
            'c', 'v', 'b', 'n', 'm', ',', '.', '/',
            ' ', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '-'};
}
